In [1]:
import pandas as pd
import numpy as np

In [2]:
fruits = ['사과', '바나나', '딸기', '포도']
prices = [3000, 2500, 4000, 3500]

In [3]:
pd.Series(prices)

0    3000
1    2500
2    4000
3    3500
dtype: int64

In [4]:
pd. Series(prices,index=fruits).mean()

np.float64(3250.0)

In [5]:
pd. Series(prices,index=fruits).sum()

np.int64(13000)

In [6]:
data = {
    '이름': ['영희', '철수', '민수'],
    '수학': [90, 70, 80],
    '영어': [85, 60, 95]}

In [7]:
score=pd.DataFrame(data)
score

   이름  수학  영어
0  영희  90  85
1  철수  70  60
2  민수  80  95

In [15]:
score[['수학','영어']]

   수학  영어
0  90  85
1  70  60
2  80  95

In [21]:
a=score.수학
a

0    90
1    70
2    80
Name: 수학, dtype: int64

In [23]:
a[0]

np.int64(90)

In [24]:
score.loc[0]

이름    영희
수학    90
영어    85
Name: 0, dtype: object

In [25]:
type(score.loc[0])

pandas.core.series.Series

In [28]:
score[(score['수학']<= 80) & (score['영어']>= 80)]

   이름  수학  영어
2  민수  80  95

In [29]:
score

   이름  수학  영어
0  영희  90  85
1  철수  70  60
2  민수  80  95

In [37]:
score['평균'] = score[['수학','영어']].mean(axis=1)
score

   이름  수학  영어    평균
0  영희  90  85  87.5
1  철수  70  60  65.0
2  민수  80  95  87.5

In [39]:
score.loc['과목별 평균']=score[['수학','영어','평균']].mean(axis=0)
score

         이름    수학    영어    평균
0        영희  90.0  85.0  87.5
1        철수  70.0  60.0  65.0
2        민수  80.0  95.0  87.5
과목별 평균  NaN  80.0  80.0  80.0

In [45]:
score[score['수학'] > 75]

         이름    수학    영어    평균
0        영희  90.0  85.0  87.5
2        민수  80.0  95.0  87.5
과목별 평균  NaN  80.0  80.0  80.0

In [46]:
score[score['수학'] > 75]['이름'].tolist()

['영희', '민수', np.float64(nan)]